Revit 2024 API
NavisworksExportOptions.ConvertElementProperties Property
 True to convert element properties, false otherwise. Default value is false.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public bool ConvertElementProperties { get; set; }
Visual Basic
Public Property ConvertElementProperties As Boolean
	Get
	Set
Visual C++
public:
property bool ConvertElementProperties {
	bool get ();
	void set (bool value);
}
See Also
NavisworksExportOptions Class
Autodesk.Revit.DB Namespace